using TyOptimization

# 定义目标函数系数
coeff = [21, 27, 13, 40, 45, 51, 37, 20, 32, 35, 20, 30]

# 定义不等式约束矩阵和右侧约束值
Aeq = [
    1 0 0 0 1 0 0 0 1 0 0 0;
    0 1 0 0 0 1 0 0 0 1 0 0;
    0 0 1 0 0 0 1 0 0 0 1 0;
    0 0 0 1 0 0 0 1 0 0 0 1;
    1 1 1 1 0 0 0 0 0 0 0 0;
    0 0 0 0 1 1 1 1 0 0 0 0;
    0 0 0 0 0 0 0 0 1 1 1 1
]
beq = [2000, 2300, 1800, 1400, 2000, 2500, 3000]

# 定义变量下上界
lb = zeros(12)  # 下界为0
ub = fill(Inf, 12)  # 上界为无穷大

# 调用 linprog 函数
x, fval, _ = linprog(coeff, [], [], Aeq, beq, lb, ub, [])

println("最优解: ", x)
println("最小运费: ", fval)
